{
  "section": "Foundations",
  "module": {
    "id": "1.1",
    "title": "Claims",
    "goal": "Understand what claims are and how they function as the basic units of reasoning.",
    "estimated_duration_minutes": 15,
    "cards": [
      {
        "id": "1.1.1",
        "title": "Welcome to the Architecture of Thought",
        "content": "Every structure begins with building blocks. For thinking, those blocks are *claims* — statements about the world that can be true or false. Learn to see them clearly, and reasoning starts to take shape."
      },
      {
        "id": "1.1.2",
        "title": "Why Start with Claims?",
        "content": "Because claims are the raw material of all arguments. You can’t evaluate logic until you know what’s actually being asserted."
      },
      {
        "id": "1.1.3",
        "title": "Defining a Claim",
        "content": "A claim is a statement that can, in principle, be true or false. It’s not about emotion — it’s about assertion. ‘The Earth orbits the Sun’ is a claim. ‘Hooray for the Sun!’ is not."
      },
      {
        "id": "1.1.4",
        "title": "Truth Value",
        "content": "Every claim carries a truth value: it’s either true, false, or uncertain. Truth value is like gravity — it keeps reasoning grounded."
      },
      {
        "id": "1.1.5",
        "title": "The Beauty of Testability",
        "content": "A claim doesn’t need to be true to be valid as a claim — it just needs to be *testable*. ‘The moon is made of cheese’ is a claim because it can be checked, even if false."
      },
      {
        "id": "1.1.6",
        "title": "Belief vs. Claim",
        "content": "Beliefs live in minds. Claims live in language. You can *believe* something privately, but a claim must be *stated* — out in the open, ready for examination."
      },
      {
        "id": "1.1.7",
        "title": "A Brick in the Wall",
        "content": "Think of claims as the bricks of reasoning. One brick alone is interesting; stack them correctly, and they become an argument."
      },
      {
        "id": "1.1.8",
        "title": "Non-Claims: The False Friends",
        "content": "Some sentences look like claims but aren’t. Questions (‘Is it raining?’), commands (‘Close the door.’), and exclamations (‘Wow!’) express ideas, not assertions."
      },
      {
        "id": "1.1.9",
        "title": "Hidden Assertions",
        "content": "‘That’s ridiculous!’ hides the claim ‘That idea is false.’ Whenever emotion speaks, reason often whispers beneath it."
      },
      {
        "id": "1.1.10",
        "title": "Spot the Claim in Conversation",
        "content": "In a debate, ask: what are we *actually* asserting? Stripping a discussion down to its core claim reveals where the real disagreement lies."
      },
      {
        "id": "1.1.11",
        "title": "The Anatomy of a Claim",
        "content": "Every claim has a subject (what we’re talking about) and a predicate (what’s being said). Example: ‘Cats are mammals.’ Subject: cats. Predicate: are mammals."
      },
      {
        "id": "1.1.12",
        "title": "Ambiguity — The Enemy of Precision",
        "content": "‘This is wrong.’ Wrong morally? Factually? Logically? Until you specify, your claim wobbles like a loose gear in a machine."
      },
      {
        "id": "1.1.13",
        "title": "Fact Claims vs. Value Claims",
        "content": "‘The Earth is warming’ is factual. ‘That’s bad’ is evaluative. Both are claims — one measured by data, the other by ethics."
      },
      {
        "id": "1.1.14",
        "title": "Simple Claims",
        "content": "A simple claim stands alone: ‘Water boils at 100°C.’ It asserts one idea — no connections, no conditions."
      },
      {
        "id": "1.1.15",
        "title": "Complex Claims",
        "content": "A complex claim links ideas using connectors: ‘If it rains, the streets get wet.’ The truth of one part depends on another."
      },
      {
        "id": "1.1.16",
        "title": "Connectors in Logic",
        "content": "‘And’, ‘or’, and ‘if…then’ are the bridges between claims. They shape how truth travels from one idea to the next."
      },
      {
        "id": "1.1.17",
        "title": "Conjunctions — The Logical AND",
        "content": "‘Cats are mammals *and* mammals are warm-blooded.’ Both parts must be true for the whole claim to hold. One false brick weakens the wall."
      },
      {
        "id": "1.1.18",
        "title": "Disjunctions — The Logical OR",
        "content": "‘It’s raining *or* snowing.’ A disjunction only needs one part to be true. In logic, ‘or’ is inclusive unless stated otherwise."
      },
      {
        "id": "1.1.19",
        "title": "Conditionals — The IF…THEN Link",
        "content": "‘If I study, then I’ll pass.’ The first part (antecedent) sets the condition; the second (consequent) predicts the outcome. Logic lives in these relationships."
      },
      {
        "id": "1.1.20",
        "title": "Biconditionals — The Double Lock",
        "content": "‘You can vote *if and only if* you’re registered.’ Both directions must hold: being registered is both necessary and sufficient to vote."
      },
      {
        "id": "1.1.21",
        "title": "Necessary vs. Sufficient",
        "content": "A key distinction: oxygen is *necessary* for fire, but not *sufficient*. You also need heat and fuel. In reasoning, learning this prevents sloppy cause claims."
      },
      {
        "id": "1.1.22",
        "title": "Precision is Power",
        "content": "A vague claim can’t be tested. ‘This generation is lazy’ collapses under scrutiny. Precision transforms generalizations into measurable assertions."
      },
      {
        "id": "1.1.23",
        "title": "Operationalizing Claims",
        "content": "To test a claim, make it measurable: replace abstractions with criteria. ‘Exercise improves mood’ → ‘People who exercise 3x weekly score higher on mood surveys.’"
      },
      {
        "id": "1.1.24",
        "title": "Context Shapes Meaning",
        "content": "‘That’s heavy.’ For a weightlifter, literal. For a philosopher, metaphorical. Claims gain clarity only when context grounds them."
      },
      {
        "id": "1.1.25",
        "title": "Ambiguity Check",
        "content": "When a claim can be interpreted multiple ways, clarify. Ambiguity is the static that garbles good reasoning."
      },
      {
        "id": "1.1.26",
        "title": "Implicit Claims",
        "content": "Some claims stay hidden: ‘He finally got what he deserved.’ What’s implied? That he did something bad, and consequences are fair. Hidden claims reveal hidden judgments."
      },
      {
        "id": "1.1.27",
        "title": "Opinions as Claims",
        "content": "‘Chocolate is the best flavor.’ Opinion, yes — but still a claim. You’re asserting something evaluative, and others can disagree."
      },
      {
        "id": "1.1.28",
        "title": "Distinguishing Taste from Truth",
        "content": "Some claims express preference (‘Jazz is better than pop’). Others assert fact (‘Jazz originated before pop’). The trick is knowing which kind you’re hearing."
      },
      {
        "id": "1.1.29",
        "title": "Descriptive vs. Normative",
        "content": "Descriptive claims describe reality (‘People lie’). Normative claims prescribe values (‘People *shouldn’t* lie’). Both are vital — but don’t confuse the map with the moral."
      },
      {
        "id": "1.1.30",
        "title": "Claims in Disguise",
        "content": "Advertising hides claims in emotion: ‘Because you’re worth it.’ The implied assertion? ‘Buying this product proves your worth.’ Always look for the hidden proposition."
      },
      {
        "id": "1.1.31",
        "title": "Cultural Context",
        "content": "A claim’s truth depends on shared definitions. ‘Success means freedom’ only makes sense inside a cultural framework. Ask: whose framework?"
      },
      {
        "id": "1.1.32",
        "title": "Unstated Assumptions",
        "content": "Every claim rides on background assumptions. ‘He deserves that job’ assumes fairness, effort, and criteria for merit. Examining assumptions reveals unseen foundations."
      },
      {
        "id": "1.1.33",
        "title": "Testable vs. Untestable",
        "content": "‘Ghosts exist’ vs. ‘Love conquers all.’ Both are statements; only one can be tested empirically. Critical thinking thrives where testing is possible."
      },
      {
        "id": "1.1.34",
        "title": "Falsifiability",
        "content": "A strong claim can be *proven wrong*. That’s not weakness — it’s courage. ‘All swans are white’ invites observation; one black swan rewrites the rule."
      },
      {
        "id": "1.1.35",
        "title": "Tautologies — Always True, Always Empty",
        "content": "‘Whatever will be, will be.’ Grammatically a claim, logically useless. A tautology can’t be false — and therefore tells us nothing."
      },
      {
        "id": "1.1.36",
        "title": "Contradictions — Always False",
        "content": "‘The circle is square.’ Contradictions collapse on contact with logic. They assert what can never be true."
      },
      {
        "id": "1.1.37",
        "title": "Analytic vs. Synthetic",
        "content": "‘All bachelors are unmarried’ — true by definition (analytic). ‘All bachelors are lonely’ — true by observation (synthetic). This distinction keeps philosophy tidy."
      },
      {
        "id": "1.1.38",
        "title": "Empirical vs. Conceptual",
        "content": "Empirical claims rely on evidence from the senses. Conceptual claims rely on reasoning from ideas. ‘Water boils at 100°C’ vs. ‘A triangle has three sides.’"
      },
      {
        "id": "1.1.39",
        "title": "Relative vs. Absolute",
        "content": "‘This is the best pizza’ — relative to taste. ‘Water freezes at 0°C’ — absolute under defined conditions. Knowing which grounds debate."
      },
      {
        "id": "1.1.40",
        "title": "Probabilistic Claims",
        "content": "‘It will probably rain tomorrow.’ Claims can carry probability. Uncertainty doesn’t make them meaningless — just nuanced."
      },
      {
        "id": "1.1.41",
        "title": "Unpacking Probability",
        "content": "We often speak in shades of gray: likely, unlikely, maybe. Turning those into explicit probability claims sharpens precision."
      },
      {
        "id": "1.1.42",
        "title": "Metaphorical Claims",
        "content": "‘Time is a thief.’ False literally, powerful conceptually. Metaphors carry emotional truth — but they aren’t testable in the same way as factual claims."
      },
      {
        "id": "1.1.43",
        "title": "Interpretation Matters",
        "content": "A single claim can be read through multiple lenses — scientific, moral, cultural. Clarifying which lens you mean prevents confusion disguised as depth."
      },
      {
        "id": "1.1.44",
        "title": "Clarity Before Critique",
        "content": "Before judging a claim, restate it clearly. You can’t refute what you haven’t first understood."
      },
      {
        "id": "1.1.45",
        "title": "Charity in Interpretation",
        "content": "When reading someone’s claim, interpret it in its strongest possible form before evaluating it. That’s intellectual honesty."
      },
      {
        "id": "1.1.46",
        "title": "Claims as Building Sites",
        "content": "Each claim is a potential foundation. Weak ones crumble under logic; strong ones can support whole structures of reasoning."
      },
      {
        "id": "1.1.47",
        "title": "When Claims Collide",
        "content": "Conflicting claims can’t both be true. ‘The Earth is flat’ and ‘The Earth is round’ can’t share the same reality. Contradiction exposes falsehood."
      },
      {
        "id": "1.1.48",
        "title": "Consistency",
        "content": "Good reasoning keeps its claims consistent. Internal contradiction is a signal to revise, not to defend harder."
      },
      {
        "id": "1.1.49",
        "title": "Supporting Claims with Evidence",
        "content": "A claim without support is opinion. A claim with evidence becomes a proposition worth believing."
      },
      {
        "id": "1.1.50",
        "title": "Layers of Support",
        "content": "Claims can support or be supported. Premises hold up conclusions, and conclusions can become premises for bigger ideas — a hierarchy of thought."
      },
      {
        "id": "1.1.51",
        "title": "Claims in Everyday Life",
        "content": "Every tweet, advertisement, and argument hides claims. The more you see them, the less you’re swayed by surface emotion."
      },
      {
        "id": "1.1.52",
        "title": "The Claim Filter",
        "content": "Before reacting, identify the claim. Pause. Ask: What exactly is being asserted? Your calm depends on your clarity."
      },
      {
        "id": "1.1.53",
        "title": "Real-World Example: News Headline",
        "content": "‘Study finds coffee extends lifespan.’ That’s a claim. Ask: what’s being measured? What does “extends” mean? Precision guards against clickbait."
      },
      {
        "id": "1.1.54",
        "title": "Real-World Example: Politics",
        "content": "‘Raising taxes hurts small business.’ Claim. But how? Always demand mechanism — vague claims wield emotional power without substance."
      },
      {
        "id": "1.1.55",
        "title": "Real-World Example: Self-Talk",
        "content": "‘I’ll never get this right.’ That’s a claim too — one worth challenging. Learning logic isn’t just academic; it’s psychological self-defense."
      },
      {
        "id": "1.1.56",
        "title": "From Observation to Claim",
        "content": "You notice: ‘The ground is wet.’ You infer: ‘It rained.’ Distinguish the observation from the claim about cause — they aren’t the same."
      },
      {
        "id": "1.1.57",
        "title": "Language as a Lens",
        "content": "Every claim is a lens, not a mirror. It frames reality through definitions and context. Critical thinkers learn to look through, not at, the lens."
      },
      {
        "id": "1.1.58",
        "title": "Simplicity is Strength",
        "content": "Complex ideas are built from simple, precise claims. If you can’t say it clearly, you don’t yet understand it deeply."
      },
      {
        "id": "1.1.59",
        "title": "The Practice of Clarity",
        "content": "Clarity is intellectual kindness. When you state claims precisely, you invite understanding instead of confusion."
      },
      {
        "id": "1.1.60",
        "title": "Summary: The Heart of Every Argument",
        "content": "Claims are the atoms of reasoning — each one carrying truth value, structure, and potential. To think clearly, start by seeing every statement as a possible claim — then ask, ‘Can it be tested? Is it clear? Is it true?’"
      }
    ]
  }
}
